sdes117/MSP430X_MSP430FR5969_LaunchPad_IAR_CCS/Blinky_Demo/main_blinky.c
/*
 * main_blinky.c  —  MSP430FR5969 HIA supervisor (bring-up build)
 *
 * Tasks
 * -----
 *  CLK  (1 Hz)   : increments second counter, drives RP regmap (writes + reads)
 *  Rx   (1 Hz)   : receives tick, toggles LEDs, pulses external WDT lines,
 *                  runs LED blink-code for RP state indication
 *  INA  (2 Hz)   : reads INA219 @ 0x41 (3V3_MSP supply current)
 *
 * Register map
 * ------------
 *  MSP writes:  0x20–0x21 (status), 0x22–0x27 (contact ack stub),
 *               0x28 (mode cmd), 0x98–0x9A (voltage/current TLM),
 *               0xA5 (TLM mode), 0xAE–0xAF (TLM status mirrors)
 *  MSP reads:   0x00–0x03 (header magic), 0x10–0x17 (RP state/health),
 *               0x30–0x33 (RP request flags), 0xF0–0xF5 (fault bitmap)
 *  All stored in g_rp_reg_snapshot (FRAM) — inspect via JTAG after a run.
 *
 * Debug — no serial
 * ------------------
 *  1. FRAM snapshot  (g_rp_reg_snapshot) persists across resets.
 *     Inspect in CCS debugger: hdr_ok, rp_state, rp_uptime_s, fault_bitmap.
 *  2. LED blink code (LED0, P1.3) every 8 seconds:
 *       N blinks = rp_state + 1   (1=BOOT, 2=INIT, 3=NOMINAL, 4=SAFE, 5=FAULT)
 *       Rapid 10 Hz blink         = RP not responding (grace/reset active)
 *
 * Rail control
 * ------------
 *  Debugger-accessible globals g_rega_en / g_regb_en / g_efusea_en / g_efuseb_en
 *  control rail enable/shutdown pins. 1=enabled (default), 0=disabled.
 */

#include "FreeRTOS.h"
#include "task.h"
#include "queue.h"

#include "partest.h"
#include "driverlib.h"
#include <msp430.h>
#include <string.h>

#include "supervisor_i2c.h"
#include "rp_regmap.h"
#include "ina219.h"

/* ------------------------------------------------------------------
 * Task priorities
 * ------------------------------------------------------------------ */
#define PRIORITY_CLK    ( tskIDLE_PRIORITY + 3u )
#define PRIORITY_RX     ( tskIDLE_PRIORITY + 2u )
#define PRIORITY_INA    ( tskIDLE_PRIORITY + 1u )

/* ------------------------------------------------------------------
 * WDT pulse config (MSP external WDT chip heartbeats)
 * ------------------------------------------------------------------ */
#define WDT_LOW_CYCLES          ( 8U )
#define MSP_WDT_PERIOD_S      ( 2U )

/* ------------------------------------------------------------------
 * RP watchdog monitor
 * ------------------------------------------------------------------ */
#define RP_WDT_TIMEOUT_S        ( 6U )
#define RP_WDT_GRACE_S          ( 10U )
#define RESET_RP_PORT           GPIO_PORT_P2
#define RESET_RP_PIN            GPIO_PIN6

/* ------------------------------------------------------------------
 * LED blink code
 * RP state blink: N = rp_state+1 blinks every BLINK_INTERVAL_S seconds.
 * Rapid blink when RP is in grace/reset window.
 * ------------------------------------------------------------------ */
#define BLINK_INTERVAL_S        ( 8U )
#define BLINK_ON_MS             ( 120U )
#define BLINK_OFF_MS            ( 120U )
#define BLINK_GAP_MS            ( 700U )   /* dark pause after sequence */
#define BLINK_RAPID_MS          ( 50U )    /* rapid: RP not responding  */
#define BLINK_RAPID_COUNT       ( 10U )

/* INA219 instance — 3V3_MSP supply line, address 0x41 */
static const ina219_t g_ina_3v3_msp = {
    .addr           = 0x41u,
    .config         = INA219_CFG_3V3_MSP,
    .calib          = INA219_CALIB_3V3_MSP,
    .current_lsb_ua = INA219_LSB_UA_3V3_MSP,
};

/* ------------------------------------------------------------------
 * Rail enable/disable GPIO
 * ------------------------------------------------------------------ */
#define REGA_EN_PORT    GPIO_PORT_P2
#define REGA_EN_PIN     GPIO_PIN4
#define REGB_EN_PORT    GPIO_PORT_P4
#define REGB_EN_PIN     GPIO_PIN4
#define EFUSEA_SHDN_PORT GPIO_PORT_P3
#define EFUSEA_SHDN_PIN  GPIO_PIN2
#define EFUSEB_SHDN_PORT GPIO_PORT_P1
#define EFUSEB_SHDN_PIN  GPIO_PIN5

/* ------------------------------------------------------------------
 * Debugger-accessible rail control globals
 * ------------------------------------------------------------------ */
volatile uint8_t g_rega_en   = 1u;
volatile uint8_t g_regb_en   = 1u;
volatile uint8_t g_efusea_en = 1u;
volatile uint8_t g_efuseb_en = 1u;

/* ------------------------------------------------------------------
 * INA219 results
 * ------------------------------------------------------------------ */
volatile ina219_data_t g_ina_data = { 0, 0, 0, 0 };
volatile uint8_t       g_ina_ok   = 0u;

#pragma PERSISTENT(g_ina_snapshot)
ina219_data_t g_ina_snapshot = { 0, 0, 0, 0 };

#pragma PERSISTENT(g_ina_snapshot_ok)
uint8_t g_ina_snapshot_ok = 0u;

#pragma PERSISTENT(g_ina_diag_init_rc)
int8_t g_ina_diag_init_rc = 0;

#pragma PERSISTENT(g_ina_diag_read_rc)
int8_t g_ina_diag_read_rc = 0;

#pragma PERSISTENT(g_ina_diag_attempts)
uint16_t g_ina_diag_attempts = 0u;

/* ------------------------------------------------------------------
 * RP register snapshot — FRAM persistent, inspect via JTAG after a run.
 * Updated by the CLK task every second from I2C reads.
 * ------------------------------------------------------------------ */
typedef struct {
    uint8_t  hdr_magic[4];         /* bytes from 0x00–0x03 ('H','I','A','1') */
    uint8_t  hdr_version;          /* REG_REGMAP_VERSION (0x04)              */
    uint8_t  hdr_ok;               /* 1 = magic verified on last read        */
    uint8_t  rp_state;             /* REG_RP_STATE (0x10)                    */
    uint32_t rp_uptime_s;          /* REG_RP_UPTIME0–3 (0x11–0x14)           */
    uint16_t rp_hb_counter;        /* REG_RP_HB0–1 (0x15–0x16)              */
    uint8_t  rp_last_error;        /* REG_RP_LAST_ERROR (0x17)               */
    uint8_t  contact_evt_pending;  /* REG_CONTACT_EVT_PENDING (0x1B)         */
    uint8_t  rp_req_flags;         /* REG_RP_REQ_FLAGS (0x30)                */
    uint8_t  rp_req_code;          /* REG_RP_REQ_CODE (0x31)                 */
    uint16_t fault_bitmap;         /* REG_FAULT_BITMAP_L/H (0xF0–0xF1)       */
    uint8_t  fault_seq;            /* REG_FAULT_SEQ (0xF2)                   */
    uint8_t  cnt_i2c_err;          /* REG_CNT_I2C_ERR (0xF5)                 */
} rp_reg_snapshot_t;

#pragma PERSISTENT(g_rp_reg_snapshot)
rp_reg_snapshot_t g_rp_reg_snapshot = { {0,0,0,0}, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0 };

/* ------------------------------------------------------------------
 * Internal state
 * ------------------------------------------------------------------ */
#pragma NOINIT(g_boot_count)
uint16_t g_boot_count;

#pragma NOINIT(g_current_second)
uint32_t g_current_second;

#pragma PERSISTENT(g_rp_reset_count)
uint16_t g_rp_reset_count = 0u;

/* ------------------------------------------------------------------
 * HIA fault state — PERSISTENT so accumulation survives warm resets.
 * All per-run counters (oc, uv) are reset in main_blinky() each boot;
 * wdt_miss_count and ext_trip carry across reboots by design.
 * ------------------------------------------------------------------ */
typedef struct {
    uint8_t  wdt_miss_count;        /* per-line misses per period; SAFE at >=3      */
    uint8_t  wdt_miss_decay_ctr;    /* seconds of healthy RP; decrement at 60       */
    uint8_t  oc_consec;             /* consecutive OC samples; latch at 3           */
    uint8_t  oc_latched;            /* 1 = OC fault active                          */
    uint8_t  oc_decay_ctr;          /* seconds since last OC; decay at 30           */
    uint8_t  uv_load;               /* 1 = UV_LOAD active (<2900 mV)                */
    uint8_t  ext_trip;              /* sticky: 1 = RST pin asserted at any boot      */
} hia_fault_t;

