sdes117/MSP430X_MSP430FR5969_LaunchPad_IAR_CCS/Blinky_Demo/main_blinky.c
#pragma PERSISTENT(g_fault)
hia_fault_t g_fault = { 0u, 0u, 0u, 0u, 0u, 0u, 0u };

/* MSP operating mode — PERSISTENT for JTAG inspection of last-run mode.
 * prvModeUpdate() forces STARTUP when g_post_passed==0, so the effective
 * mode on each boot starts at STARTUP regardless of persisted value. */
#pragma PERSISTENT(g_msp_mode)
uint8_t g_msp_mode = MODE_STARTUP;

/* POST gate — non-persistent, re-evaluated each boot from fresh sensor reads */
uint8_t g_post_passed = 0u;

/* RP heartbeat period — read from REG_WDT_PERIOD_S at runtime; default 2 s.
 * WDT miss assessment fires once per this many CLK ticks. */
static uint8_t g_wdt_period_s = 2u;

/* Shared between CLK and Rx: CLK sets flag, Rx consumes it for blink */
static volatile uint8_t g_blink_pending  = 0u;  /* 1 = run blink sequence  */
static volatile uint8_t g_blink_rp_state = 0u;  /* state to blink          */
static volatile uint8_t g_blink_rapid    = 0u;  /* 1 = rapid (RP down)     */

static QueueHandle_t xTickQueue = NULL;

extern volatile uint16_t g_last_sysrstiv;

/* ------------------------------------------------------------------
 * Forward declarations
 * ------------------------------------------------------------------ */
static void prvClockTask  (void *pvParameters);
static void prvRxTask     (void *pvParameters);
static void prvInaTask    (void *pvParameters);

static inline void prvApplyRailEnables(void);
static inline void prvPulseWdt1(void);
static inline void prvPulseWdt2(void);
static inline void prvLedSet(uint8_t on);
static void        prvRunBlinkSequence(void);
static int8_t      prv_rp_read(uint8_t reg, uint8_t *buf, uint8_t len);
static void        prvFaultUpdate(uint8_t rp_i2c_ok, uint8_t wdt_miss_lines,
                                  int16_t current_ma,
                                  uint16_t bus_mv, uint8_t ina_valid);
static void        prvModeUpdate (uint8_t rp_wdt_grace, uint8_t rp_state);

/* ------------------------------------------------------------------
 * Entry point
 * ------------------------------------------------------------------ */
void main_blinky(void)
{
    uint16_t boot_cause = g_last_sysrstiv;

    if (boot_cause <= SYSRSTIV_DOBOR)
    {
        if (boot_cause <= SYSRSTIV_RSTNMI)
            g_current_second = 0u;
    }
    ++g_boot_count;

    /* Detect external WDT trip (TPS3435 RST pin assertion) — sticky, cleared by ground command */
    if (boot_cause == SYSRSTIV_RSTNMI)
        g_fault.ext_trip = 1u;

    /* RegB and EfuseB hardware is removed — force them off unconditionally */
    g_regb_en   = 0u;
    g_efuseb_en = 0u;

    /* Clear per-run fault state — re-evaluated from fresh sensor readings.
     * wdt_miss_count and ext_trip carry over intentionally. */
    g_fault.uv_load          = 0u;
    g_fault.oc_consec        = 0u;
    g_fault.oc_latched       = 0u;
    g_fault.oc_decay_ctr     = 0u;
    g_fault.wdt_miss_decay_ctr = 0u;

    prvApplyRailEnables();

    xTickQueue = xQueueCreate(8u, sizeof(uint8_t));
    configASSERT(xTickQueue != NULL);

    xTaskCreate(prvClockTask, "CLK", configMINIMAL_STACK_SIZE, NULL, PRIORITY_CLK, NULL);
    xTaskCreate(prvRxTask,    "Rx",  configMINIMAL_STACK_SIZE, NULL, PRIORITY_RX,  NULL);
    xTaskCreate(prvInaTask,   "INA", configMINIMAL_STACK_SIZE, NULL, PRIORITY_INA, NULL);

    vTaskStartScheduler();

    for (;;);
}

/* ------------------------------------------------------------------
 * CLK task — 1 Hz heartbeat, RP regmap I/O
 * ------------------------------------------------------------------ */
static void prvClockTask(void *pvParameters)
{
    TickType_t xNext          = xTaskGetTickCount();
    uint8_t    tick           = 1u;
    uint8_t    rp_wdt_timer   = 0u;    /* counts missed periods; resets on good period */
    uint8_t    rp_wdt_grace   = RP_WDT_GRACE_S;
    uint8_t    wdt_period_ctr = 0u;    /* CLK ticks within current heartbeat period */
    uint8_t    rp_period_ok   = 0u;    /* cached result from last period assessment */
    uint8_t    blink_counter  = 0u;
    uint8_t    last_cmd_seq   = 0u;    /* track CMD_SEQ written to RP */
    (void)pvParameters;

    /* Convenience macro: write one register to RP then yield briefly so
     * CircuitPython can process it before the next transaction. */
    #define RP_WRITE(reg, ptr, len) \
        (void)i2c_write_reg(RP_I2C_ADDR, (reg), (ptr), (len)); \
        vTaskDelay(pdMS_TO_TICKS(10u))

    /* prv_rp_read used in place of the old RP_READ macro so the return
     * value is usable in if() conditions. */

    for (;;)
    {
        vTaskDelayUntil(&xNext, pdMS_TO_TICKS(1000u));
        ++g_current_second;

        /* ---- RP watchdog monitor  (evaluated FIRST — determines rp_i2c_ok)
         * Skipping I2C writes when RP is non-responsive prevents multi-second
         * stalls that would starve the Rx task and trigger TPS3435 co-reset.
         * ---------------------------------------------------------------- */
        uint8_t rp_i2c_ok     = 0u;
        uint8_t wdt_miss_lines = 0u;   /* missing WDT lines this period (0, 1, or 2) */

        if (rp_wdt_grace > 0u)
        {
            --rp_wdt_grace;
            if (rp_wdt_grace == 0u)
            {
                /* Grace expired — flush IFG and reset period counter for clean start */
                P3IFG        &= (uint8_t)~(BIT1 | BIT7);
                wdt_period_ctr = 0u;
            }
            /* RP rebooting — hold rp_i2c_ok=0; rp_period_ok already 0 */
        }
        else
        {
            /* Use cached result from last period for all ticks between assessments */
            rp_i2c_ok = rp_period_ok;

            /* Assess lines once per heartbeat period */
            if (++wdt_period_ctr >= g_wdt_period_s)
            {
                wdt_period_ctr = 0u;

                uint8_t rp_ifg   = P3IFG & (BIT1 | BIT7);
                P3IFG           &= (uint8_t)~(BIT1 | BIT7);   /* clear for next period */
                uint8_t line1_ok = (rp_ifg & BIT1) != 0u;
                uint8_t line2_ok = (rp_ifg & BIT7) != 0u;

