sdes117/MSP430X_MSP430FR5969_LaunchPad_IAR_CCS/Blinky_Demo/main_blinky.c
                if (line1_ok && line2_ok)
                {
                    rp_wdt_timer = 0u;
                    rp_period_ok = 1u;
                    rp_i2c_ok    = 1u;
                }
                else
                {
                    /* Count each absent line as a separate fault event */
                    if (!line1_ok) ++wdt_miss_lines;
                    if (!line2_ok) ++wdt_miss_lines;

                    /* Timeout expressed in periods: RP_WDT_TIMEOUT_S / period_s */
                    uint8_t timeout_periods = (g_wdt_period_s > 0u)
                                              ? (uint8_t)(RP_WDT_TIMEOUT_S / g_wdt_period_s)
                                              : (uint8_t)RP_WDT_TIMEOUT_S;
                    if (timeout_periods == 0u) timeout_periods = 1u;

                    ++rp_wdt_timer;
                    if (rp_wdt_timer >= timeout_periods)
                    {
                        rp_wdt_timer = 0u;
                        ++g_rp_reset_count;
                        GPIO_setOutputLowOnPin(RESET_RP_PORT, RESET_RP_PIN);
                        vTaskDelay(pdMS_TO_TICKS(5u));
                        GPIO_setOutputHighOnPin(RESET_RP_PORT, RESET_RP_PIN);
                        supervisor_i2c_recover();
                        rp_wdt_grace = RP_WDT_GRACE_S;
                        rp_period_ok = 0u;
                        rp_i2c_ok    = 0u;
                    }
                    else
                    {
                        /* Missed period but timer not expired — RP likely still alive */
                        rp_period_ok = 1u;
                        rp_i2c_ok    = 1u;
                    }
                }
            }
        }

        /* ---- I2C reads from RP (before fault/mode evaluation) ------------- */
        if (rp_i2c_ok)
        {
            uint8_t rd[9];   /* sized for header read 0x00–0x08 */

            /* Header magic + WDT period — check every 4 s */
            if ((g_current_second & 0x03u) == 0u)
            {
                /* Read 9 bytes: 0x00–0x08 covers magic, version, and WDT_PERIOD_S */
                if (prv_rp_read(REG_MAGIC0, rd, 9u) == I2C_OK)
                {
                    memcpy(g_rp_reg_snapshot.hdr_magic, rd, 4u);
                    g_rp_reg_snapshot.hdr_version = rd[4];
                    g_rp_reg_snapshot.hdr_ok =
                        (rd[0] == HDR_MAGIC0_VAL &&
                         rd[1] == HDR_MAGIC1_VAL &&
                         rd[2] == HDR_MAGIC2_VAL &&
                         rd[3] == HDR_MAGIC3_VAL) ? 1u : 0u;
                    /* rd[8] = REG_WDT_PERIOD_S (offset 0x08 - 0x00) */
                    if (rd[8] >= 1u && rd[8] <= 10u)
                        g_wdt_period_s = rd[8];
                }
            }

            /* RP state/health block (0x10–0x17) — every second */
            if (prv_rp_read(REG_RP_STATE, rd, 8u) == I2C_OK)
            {
                g_rp_reg_snapshot.rp_state      = rd[0];
                g_rp_reg_snapshot.rp_uptime_s   = (uint32_t)rd[1]
                                                 | ((uint32_t)rd[2] << 8)
                                                 | ((uint32_t)rd[3] << 16)
                                                 | ((uint32_t)rd[4] << 24);
                g_rp_reg_snapshot.rp_hb_counter = (uint16_t)rd[5]
                                                 | ((uint16_t)rd[6] << 8);
                g_rp_reg_snapshot.rp_last_error = rd[7];
            }

            /* RP request flags (0x30–0x33) — every second */
            if (prv_rp_read(REG_RP_REQ_FLAGS, rd, 4u) == I2C_OK)
            {
                g_rp_reg_snapshot.rp_req_flags = rd[0];
                g_rp_reg_snapshot.rp_req_code  = rd[1];
            }

            /* Fault bitmap (0xF0–0xF5) — every 4 s */
            if ((g_current_second & 0x03u) == 0u)
            {
                if (prv_rp_read(REG_FAULT_BITMAP_L, rd, 6u) == I2C_OK)
                {
                    g_rp_reg_snapshot.fault_bitmap = (uint16_t)rd[0]
                                                   | ((uint16_t)rd[1] << 8);
                    g_rp_reg_snapshot.fault_seq    = rd[2];
                    /* rd[3]=LATCH_FLAGS  rd[4]=reserved  rd[5]=CNT_I2C_ERR */
                    g_rp_reg_snapshot.cnt_i2c_err  = rd[5];
                }
            }

            /* POST gate: set once RP header verified and INA is responding */
            if (!g_post_passed && g_rp_reg_snapshot.hdr_ok && g_ina_ok)
                g_post_passed = 1u;
        }

        /* ---- Fault and mode state machine ---------------------------------- */
        /* Capture INA snapshot atomically for this tick */
        int16_t  tick_ma    = g_ina_data.current_ma;
        uint16_t tick_mv    = g_ina_data.bus_mv;
        uint8_t  tick_ina   = g_ina_ok;

        prvFaultUpdate(rp_i2c_ok, wdt_miss_lines, tick_ma, tick_mv, tick_ina);
        prvModeUpdate(rp_wdt_grace, g_rp_reg_snapshot.rp_state);

        /* ---- Signal Rx task: trigger blink every BLINK_INTERVAL_S seconds */
        if (++blink_counter >= BLINK_INTERVAL_S)
        {
            blink_counter    = 0u;
            g_blink_rp_state = g_rp_reg_snapshot.rp_state;
            g_blink_rapid    = (rp_wdt_grace > 0u) ? 1u : 0u;
            g_blink_pending  = 1u;
        }

        /* ---- Build MSP status bytes ---------------------------------------- */
        uint8_t wdt_ok  = ((P2OUT & BIT2) && (P3OUT & BIT4)) ? 1u : 0u;
        uint8_t rail_ok = (g_rega_en && g_efusea_en) ? 1u : 0u;
        uint8_t batt_ok = tick_ina;

        uint8_t s0 = (uint8_t)(
              (g_msp_mode & STATUS0_MODE_MASK)
            | (wdt_ok  ? STATUS0_WDT_OK  : 0u)
            | (batt_ok ? STATUS0_BATT_OK : 0u)
            | (rail_ok ? STATUS0_RAIL_OK : 0u));

        uint8_t s1 = (uint8_t)(
              (g_fault.oc_latched ? STATUS1_OC_MCU  : 0u)
            | (g_fault.uv_load    ? STATUS1_UV_LOAD : 0u));

        uint8_t mode_byte = g_msp_mode;

        /* ---- I2C writes to RP (only when RP is known responsive) ----------- */
        if (rp_i2c_ok)
        {
            /* --- MSP status --- */
            RP_WRITE(REG_MSP_STATUS0,     &s0,        1u);
            RP_WRITE(REG_MSP_STATUS1,     &s1,        1u);

            /* --- Contact ack stub (all zeros — no radio on dev board) --- */
            static const uint8_t ack_stub[6] = { 0u, 0u, 0u, 0u, 0u, 0u };
            RP_WRITE(REG_CONTACT_ACK_SEQ, ack_stub,   6u);

