sdes117/MSP430X_MSP430FR5969_LaunchPad_IAR_CCS/Blinky_Demo/main_blinky.c
            /* --- Mode command --- */
            RP_WRITE(REG_MODE_CMD,        &mode_byte, 1u);

            /* Increment CMD_SEQ so RP can ACK (monotonic, wraps at 255) */
            ++last_cmd_seq;
            RP_WRITE(REG_CMD_SEQ,         &last_cmd_seq, 1u);

            /* --- Telemetry --- */
            RP_WRITE(REG_TLM_MODE,        &mode_byte, 1u);
            RP_WRITE(REG_TLM_MSP_STATUS0, &s0,        1u);
            RP_WRITE(REG_TLM_MSP_STATUS1, &s1,        1u);

            if (tick_ina)
            {
                RP_WRITE(REG_TLM_VBATT_MV, (const uint8_t *)&tick_mv, 2u);
                RP_WRITE(REG_TLM_IBATT_MA, (const uint8_t *)&tick_ma, 2u);
            }

            /* TLM_TBATT_CC — no sensor on dev board, leave as zero */
        }

        #undef RP_WRITE

        /* Send tick to Rx task */
        xQueueSend(xTickQueue, &tick, 0u);
    }
}

/* ------------------------------------------------------------------
 * Rx task — LED toggle + WDT pulse + LED blink code
 * ------------------------------------------------------------------ */
static void prvRxTask(void *pvParameters)
{
    uint8_t  tick;
    uint32_t wdt1_counter = 0u;
    uint32_t wdt2_counter = 0u;
    (void)pvParameters;

    for (;;)
    {
        xQueueReceive(xTickQueue, &tick, portMAX_DELAY);

        /* Apply rail enables */
        prvApplyRailEnables();

        /* Pulse WDT1 (P2.2) */
        if (++wdt1_counter >= MSP_WDT_PERIOD_S)
        {
            wdt1_counter = 0u;
            prvPulseWdt1();
        }

        /* Pulse WDT2 (P3.4) */
        if (++wdt2_counter >= MSP_WDT_PERIOD_S)
        {
            wdt2_counter = 0u;
            prvPulseWdt2();
        }

        /* LED blink code — consumes blink_pending flag set by CLK task.
         * Runs blink sequence here (inside Rx) so we can use vTaskDelay
         * without affecting CLK task timing. Maximum blocking ~1.5 s which
         * is within the 2-second WDT pulse window. */
        if (g_blink_pending)
        {
            g_blink_pending = 0u;
            prvRunBlinkSequence();
        }
        else
        {
            /* Normal 1 Hz activity toggle */
            vParTestToggleLED(0);
        }
    }
}

/* ------------------------------------------------------------------
 * INA task — read INA219 @ 0x41 at 2 Hz
 * ------------------------------------------------------------------ */
static void prvInaTask(void *pvParameters)
{
    TickType_t   xNext  = xTaskGetTickCount();
    uint8_t      inited = 0u;
    ina219_data_t data;
    (void)pvParameters;

    if (g_ina_snapshot_ok)
        vTaskDelay(pdMS_TO_TICKS(15000u));

    for (;;)
    {
        vTaskDelayUntil(&xNext, pdMS_TO_TICKS(500u));

        if (!inited)
        {
            int8_t irc = ina219_init(&g_ina_3v3_msp);
            g_ina_diag_init_rc = irc;
            ++g_ina_diag_attempts;
            if (irc != INA219_OK)
                continue;
            inited = 1u;
        }

        {
            int8_t rrc = ina219_read(&g_ina_3v3_msp, &data);
            g_ina_diag_read_rc = rrc;
            if (rrc == INA219_OK)
            {
                g_ina_data        = data;
                g_ina_ok          = 1u;
                g_ina_snapshot    = data;
                g_ina_snapshot_ok = 1u;
            }
            else
            {
                g_ina_ok = 0u;
                inited   = 0u;
            }
        }
    }
}

/* ------------------------------------------------------------------
 * RP I2C read helper — performs read then yields 10 ms so CircuitPython
 * can process the next transaction.  Returns the i2c_read_reg() result
 * so callers can use it in if() conditions (the old RP_READ macro could
 * not be used that way).
 * ------------------------------------------------------------------ */
static int8_t prv_rp_read(uint8_t reg, uint8_t *buf, uint8_t len)
{
    int8_t rc = i2c_read_reg(RP_I2C_ADDR, reg, buf, (uint8_t)len);
    vTaskDelay(pdMS_TO_TICKS(10u));
    return rc;
}

/* ------------------------------------------------------------------
 * Fault update — called once per CLK tick with fresh sensor data.
 *
 * WDT_RP_MISS  : wdt_miss_lines counts each absent WDT line this tick
 *                (0, 1, or 2); accumulated into wdt_miss_count.  Decays
 *                1 count per 60 s of healthy RP (rp_i2c_ok=1, no misses).
 * OC_MCU       : latches after 3 consecutive samples >100 mA; decays
 *                1 count per 30 s of healthy current; clears at 0.
 * UV_LOAD      : set when bus_mv < 2900, cleared when bus_mv > 3000.
 * EXT_TRIP     : sticky — set in main_blinky() from SYSRSTIV, not here.
 * ------------------------------------------------------------------ */
static void prvFaultUpdate(uint8_t rp_i2c_ok, uint8_t wdt_miss_lines,
                           int16_t current_ma,
                           uint16_t bus_mv, uint8_t ina_valid)
{
    /* --- WDT_RP_MISS ------------------------------------------------ */
    if (wdt_miss_lines > 0u)
    {
        /* Accumulate per-line misses (clamped to 255) */
        if (wdt_miss_lines < (uint8_t)(255u - g_fault.wdt_miss_count))
            g_fault.wdt_miss_count += wdt_miss_lines;
        else
            g_fault.wdt_miss_count = 255u;
        g_fault.wdt_miss_decay_ctr = 0u;   /* restart decay window on miss */
    }
    else if (rp_i2c_ok && (g_fault.wdt_miss_count > 0u))
    {
        if (++g_fault.wdt_miss_decay_ctr >= 60u)
        {
            g_fault.wdt_miss_decay_ctr = 0u;
            --g_fault.wdt_miss_count;
        }
    }

    /* --- OC_MCU ----------------------------------------------------- */
    if (ina_valid)
    {
        if (current_ma > (int16_t)100)
        {
            if (!g_fault.oc_latched)
            {
                if (++g_fault.oc_consec >= 3u)
                    g_fault.oc_latched = 1u;
            }
            g_fault.oc_decay_ctr = 0u;       /* reset decay while OC active */
        }
        else
        {
            if (!g_fault.oc_latched)
            {
                g_fault.oc_consec = 0u;       /* clear counter when healthy */
            }
            else
            {
                /* Latched — decay 1 count per 30 s of healthy current */
                if (++g_fault.oc_decay_ctr >= 30u)
                {
                    g_fault.oc_decay_ctr = 0u;
                    if (g_fault.oc_consec > 0u)
                        --g_fault.oc_consec;
                    if (g_fault.oc_consec == 0u)
                        g_fault.oc_latched = 0u;
                }
            }
        }
    }

