sdes117/MSP430X_MSP430FR5969_LaunchPad_IAR_CCS/Blinky_Demo/main_blinky.c
    /* --- UV_LOAD ---------------------------------------------------- */
    if (ina_valid)
    {
        if (!g_fault.uv_load && (bus_mv < 2900u))
            g_fault.uv_load = 1u;
        else if (g_fault.uv_load && (bus_mv > 3000u))
            g_fault.uv_load = 0u;
    }
}

/* ------------------------------------------------------------------
 * Mode state machine — called once per CLK tick after prvFaultUpdate.
 *
 * STARTUP  → NOMINAL : POST passed + RP responding nominal + no faults
 * NOMINAL  → SAFE    : wdt_miss_count >= 3  OR  oc_latched
 * SAFE     → NOMINAL : all faults clear + RP responding nominal
 * ANY      → SURVIVAL: uv_load active  (overrides all other transitions;
 *                       power rails are NOT cut — MSP is always-on)
 * SURVIVAL → SAFE    : uv_load cleared
 *
 * While g_post_passed == 0 (not yet verified), mode is forced to STARTUP
 * regardless of persisted g_msp_mode value.
 * ------------------------------------------------------------------ */
static void prvModeUpdate(uint8_t rp_wdt_grace, uint8_t rp_state)
{
    uint8_t rp_ok       = (rp_wdt_grace == 0u) && (rp_state == RP_STATE_NOMINAL);
    uint8_t faults_none = (g_fault.wdt_miss_count < 3u) && !g_fault.oc_latched;

    /* POST gate — mode stays STARTUP until first successful verification */
    if (!g_post_passed)
    {
        g_msp_mode = MODE_STARTUP;
        return;
    }

    /* UV_LOAD: highest priority — push to SURVIVAL from any state */
    if (g_fault.uv_load)
    {
        g_msp_mode = MODE_LOW_POWER;
        return;
    }

    /* Leaving SURVIVAL: safe landing in SAFE (not directly NOMINAL) */
    if (g_msp_mode == MODE_LOW_POWER)
    {
        g_msp_mode = MODE_SAFE;
        return;
    }

    switch (g_msp_mode)
    {
        case MODE_STARTUP:
            if (rp_ok && faults_none)
                g_msp_mode = MODE_NOMINAL;
            break;

        case MODE_NOMINAL:
            if (!faults_none)
                g_msp_mode = MODE_SAFE;
            break;

        case MODE_SAFE:
            if (faults_none && rp_ok)
                g_msp_mode = MODE_NOMINAL;
            break;

        default:
            g_msp_mode = MODE_STARTUP;
            break;
    }
}

/* ------------------------------------------------------------------
 * LED blink sequence
 *
 * Rapid mode (RP down):  BLINK_RAPID_COUNT fast pulses
 * Normal mode:           rp_state+1 pulses at BLINK_ON/OFF_MS cadence,
 *                        then BLINK_GAP_MS dark pause
 *
 * Uses vTaskDelay — Rx task blocks during blink (~1 s max).
 * MSP_WDT_PERIOD_S = 2 s so one missed tick is always safe.
 * ------------------------------------------------------------------ */
static void prvRunBlinkSequence(void)
{
    uint8_t i;

    if (g_blink_rapid)
    {
        for (i = 0u; i < BLINK_RAPID_COUNT; i++)
        {
            prvLedSet(1u);
            vTaskDelay(pdMS_TO_TICKS(BLINK_RAPID_MS));
            prvLedSet(0u);
            vTaskDelay(pdMS_TO_TICKS(BLINK_RAPID_MS));
        }
        return;
    }

    /* N = rp_state + 1, clamped to [1, 8] */
    uint8_t n = (uint8_t)(g_blink_rp_state + 1u);
    if (n > 8u) n = 8u;

    for (i = 0u; i < n; i++)
    {
        prvLedSet(1u);
        vTaskDelay(pdMS_TO_TICKS(BLINK_ON_MS));
        prvLedSet(0u);
        if (i < (uint8_t)(n - 1u))
            vTaskDelay(pdMS_TO_TICKS(BLINK_OFF_MS));
    }
    vTaskDelay(pdMS_TO_TICKS(BLINK_GAP_MS));
}

/* ------------------------------------------------------------------
 * LED direct drive helper (P1.3 = LED0)
 * ------------------------------------------------------------------ */
static inline void prvLedSet(uint8_t on)
{
    if (on)
        GPIO_setOutputHighOnPin(GPIO_PORT_P1, GPIO_PIN3);
    else
        GPIO_setOutputLowOnPin(GPIO_PORT_P1, GPIO_PIN3);
}

/* ------------------------------------------------------------------
 * Rail enable helper
 * ------------------------------------------------------------------ */
static inline void prvApplyRailEnables(void)
{
    /* RegA + EfuseA: ALWAYS-ON rail powering the MSP — never cut by mode logic.
     * Debugger override (g_rega_en / g_efusea_en) respected for bench testing. */
    if (g_rega_en)   GPIO_setOutputLowOnPin (REGA_EN_PORT,     REGA_EN_PIN);
    else             GPIO_setOutputHighOnPin(REGA_EN_PORT,     REGA_EN_PIN);

    /* RegB: hardware removed — always off */
    GPIO_setOutputHighOnPin(REGB_EN_PORT, REGB_EN_PIN);

    if (g_efusea_en) GPIO_setOutputLowOnPin (EFUSEA_SHDN_PORT, EFUSEA_SHDN_PIN);
    else             GPIO_setOutputHighOnPin(EFUSEA_SHDN_PORT, EFUSEA_SHDN_PIN);

    /* EfuseB: hardware removed — always off */
    GPIO_setOutputHighOnPin(EFUSEB_SHDN_PORT, EFUSEB_SHDN_PIN);
}

/* ------------------------------------------------------------------
 * WDT pulse helpers
 * ------------------------------------------------------------------ */
static inline void prvPulseWdt1(void)
{
    taskENTER_CRITICAL();
    P2OUT &= (uint8_t)~BIT2;
    __delay_cycles(WDT_LOW_CYCLES);
    P2OUT |= BIT2;
    taskEXIT_CRITICAL();
}

static inline void prvPulseWdt2(void)
{
    taskENTER_CRITICAL();
    P3OUT &= (uint8_t)~BIT4;
    __delay_cycles(WDT_LOW_CYCLES);
    P3OUT |= BIT4;
    taskEXIT_CRITICAL();
}
